Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21b/edc/ATSAML21E17B.PIC
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLCTRLB" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnn---n-nnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FF173F" edc:_addr="0x40000C30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FILTER" edc:nzwidth="0x2" edc:desc="Proportional Integral Filter Selection">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Default filter mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LBFILT" edc:desc="Low bandwidth filter" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="HBFILT" edc:desc="High bandwidth filter" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="HDFILT" edc:desc="High damping filter" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LPEN" edc:nzwidth="0x1" edc:desc="Low-Power Enable"/>
            <edc:SFRFieldDef edc:cname="WUF" edc:nzwidth="0x1" edc:desc="Wake Up Fast"/>
            <edc:SFRFieldDef edc:cname="REFCLK" edc:nzwidth="0x2" edc:desc="Reference Clock Selection">
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K clock reference" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC clock reference" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="GCLK clock reference" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LTIME" edc:nzwidth="0x3" edc:desc="Lock Time">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="No time-out. Automatic lock." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="8MS" edc:desc="Time-out if no lock within 8ms" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="9MS" edc:desc="Time-out if no lock within 9ms" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="10MS" edc:desc="Time-out if no lock within 10ms" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="11MS" edc:desc="Time-out if no lock within 11ms" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LBYPASS" edc:nzwidth="0x1" edc:desc="Lock Bypass"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0xB" edc:desc="Clock Divider"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLPRESC" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40000C34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="PRESC" edc:nzwidth="0x2" edc:desc="Output Clock Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="DPLL output is divided by 1" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="DPLL output is divided by 2" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="DPLL output is divided by 4" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000C35"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLSYNCBUSY" edc:nzwidth="0x8" edc:access="----rrr-" edc:por="00000000" edc:mclr="00000000" edc:impl="0xE" edc:_addr="0x40000C38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DPLL Enable Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="DPLLRATIO" edc:nzwidth="0x1" edc:desc="DPLL Ratio Synchronization Status"/>
            <edc:SFRFieldDef edc:cname="DPLLPRESC" edc:nzwidth="0x1" edc:desc="DPLL Prescaler Synchronization Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x40000C39"/>
      <edc:SFRDef ltx:memberofperipheral="OSCCTRL" edc:cname="DPLLSTATUS" edc:nzwidth="0x8" edc:access="------rr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40000C3C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="DPLL Lock Status"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:nzwidth="0x1" edc:desc="DPLL Clock Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C3" edc:_addr="0x40000C3D"/>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x40001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:nzwidth="0x1" edc:desc="OSC32K Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x40001004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:nzwidth="0x1" edc:desc="OSC32K Ready Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x40001008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:nzwidth="0x1" edc:desc="OSC32K Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3" edc:_addr="0x4000100C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:nzwidth="0x1" edc:desc="XOSC32K Ready"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:nzwidth="0x1" edc:desc="OSC32K Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="RTCCTRL" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:_addr="0x40001010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:SFRFieldDef edc:cname="RTCSEL" edc:nzwidth="0x3" edc:desc="RTC Clock Selection">
              <edc:SFRFieldSemantic edc:cname="ULP1K" edc:desc="1.024kHz from 32kHz internal ULP oscillator" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ULP32K" edc:desc="32.768kHz from 32kHz internal ULP oscillator" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OSC1K" edc:desc="1.024kHz from 32.768kHz internal oscillator" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="32.768kHz from 32.768kHz internal oscillator" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="XOSC1K" edc:desc="1.024kHz from 32.768kHz internal oscillator" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="32.768kHz from 32.768kHz external crystal oscillator" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="XOSC32K" edc:nzwidth="0x20" edc:access="-------------------n-nnnnn-nnnn-" edc:por="00000000000000000000000010000000" edc:mclr="00000000000000000000000010000000" edc:impl="0x17DE" edc:_addr="0x40001014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:nzwidth="0x1" edc:desc="Crystal Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:nzwidth="0x1" edc:desc="32kHz Output Enable"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:nzwidth="0x1" edc:desc="1kHz Output Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x3" edc:desc="Oscillator Start-Up Time">
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="62.5 ms" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="125 ms" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="500 ms" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="1000 ms" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE65536" edc:desc="2000 ms" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE131072" edc:desc="4000 ms" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE262144" edc:desc="8000 ms" edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="OSC32K" edc:nzwidth="0x20" edc:access="---------nnnnnnn---n-nnnnn--nnn-" edc:por="00000000001111110000000010000000" edc:mclr="00000000001111110000000010000000" edc:impl="0x7F17CE" edc:_addr="0x40001018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:nzwidth="0x1" edc:desc="32kHz Output Enable"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:nzwidth="0x1" edc:desc="1kHz Output Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:nzwidth="0x1" edc:desc="On Demand Control"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x3" edc:desc="Oscillator Start-Up Time">
              <edc:SFRFieldSemantic edc:cname="CYCLE3" edc:desc="0.092 ms" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4" edc:desc="0.122 ms" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE6" edc:desc="0.183 ms" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE10" edc:desc="0.305 ms" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE18" edc:desc="0.549 ms" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE34" edc:desc="1.038 ms" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE66" edc:desc="2.014 ms" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE130" edc:desc="3.967 ms" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:nzwidth="0x7" edc:desc="Oscillator Calibration"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="OSC32KCTRL" edc:cname="OSCULP32K" edc:nzwidth="0x20" edc:access="----------------n--nnnnn--------" edc:impl="0x9F00" edc:_addr="0x4000101C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSC32KCTRL">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CALIB" edc:nzwidth="0x5" edc:desc="Oscillator Calibration"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
