Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21b/edc/ATSAML21E17B.PIC
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42003006">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="UNDERRUN0" edc:nzwidth="0x1" edc:desc="DAC 0 Underrun"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN1" edc:nzwidth="0x1" edc:desc="DAC 1 Underrun"/>
            <edc:SFRFieldDef edc:cname="EMPTY0" edc:nzwidth="0x1" edc:desc="Data Buffer 0 Empty"/>
            <edc:SFRFieldDef edc:cname="EMPTY1" edc:nzwidth="0x1" edc:desc="Data Buffer 1 Empty"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="----rrrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x42003007">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="READY0" edc:nzwidth="0x1" edc:desc="DAC 0 Startup Ready"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:nzwidth="0x1" edc:desc="DAC 1 Startup Ready"/>
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="DAC 0 End of Conversion"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="DAC 1 End of Conversion"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F" edc:_addr="0x42003008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DAC Enable Status"/>
            <edc:SFRFieldDef edc:cname="DATA0" edc:nzwidth="0x1" edc:desc="Data DAC 0"/>
            <edc:SFRFieldDef edc:cname="DATA1" edc:nzwidth="0x1" edc:desc="Data DAC 1"/>
            <edc:SFRFieldDef edc:cname="DATABUF0" edc:nzwidth="0x1" edc:desc="Data Buffer DAC 0"/>
            <edc:SFRFieldDef edc:cname="DATABUF1" edc:nzwidth="0x1" edc:desc="Data Buffer DAC 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DACCTRL0" edc:nzwidth="0x10" edc:access="----nnnnnn--nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFCF" edc:_addr="0x4200300C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left Adjusted Data"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable DAC0"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:nzwidth="0x2" edc:desc="Current Control">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="GCLK_DAC &lt;= 1.2MHz (100kSPS)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="1.2MHz &lt; GCLK_DAC &lt;= 6MHz (500kSPS)" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="6MHz &lt; GCLK_DAC &lt;=12MHz (1MSPS)" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:nzwidth="0x1" edc:desc="Dithering Mode"/>
            <edc:SFRFieldDef edc:cname="REFRESH" edc:nzwidth="0x4" edc:desc="Refresh period">
              <edc:SFRFieldSemantic edc:cname="REFRESH_0" edc:desc="Do not Refresh" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_2" edc:desc="Refresh every 60US" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_3" edc:desc="Refresh every 90US" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_4" edc:desc="Refresh every 120US" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_5" edc:desc="Refresh every 150US" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_6" edc:desc="Refresh every 180US" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_7" edc:desc="Refresh every 210US" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_8" edc:desc="Refresh every 240US" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_9" edc:desc="Refresh every 270US" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_10" edc:desc="Refresh every 300US" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_11" edc:desc="Refresh every 330US" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_12" edc:desc="Refresh every 360US" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_13" edc:desc="Refresh every 390US" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_14" edc:desc="Refresh every 420US" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_15" edc:desc="Refresh every 450US" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DACCTRL1" edc:nzwidth="0x10" edc:access="----nnnnnn--nnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFCF" edc:_addr="0x4200300E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left Adjusted Data"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable DAC0"/>
            <edc:SFRFieldDef edc:cname="CCTRL" edc:nzwidth="0x2" edc:desc="Current Control">
              <edc:SFRFieldSemantic edc:cname="CC100K" edc:desc="GCLK_DAC &lt;= 1.2MHz (100kSPS)" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CC1M" edc:desc="1.2MHz &lt; GCLK_DAC &lt;= 6MHz (500kSPS)" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CC12M" edc:desc="6MHz &lt; GCLK_DAC &lt;=12MHz (1MSPS)" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="DITHER" edc:nzwidth="0x1" edc:desc="Dithering Mode"/>
            <edc:SFRFieldDef edc:cname="REFRESH" edc:nzwidth="0x4" edc:desc="Refresh period">
              <edc:SFRFieldSemantic edc:cname="REFRESH_0" edc:desc="Do not Refresh" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_2" edc:desc="Refresh every 60US" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_3" edc:desc="Refresh every 90US" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_4" edc:desc="Refresh every 120US" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_5" edc:desc="Refresh every 150US" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_6" edc:desc="Refresh every 180US" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_7" edc:desc="Refresh every 210US" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_8" edc:desc="Refresh every 240US" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_9" edc:desc="Refresh every 270US" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_10" edc:desc="Refresh every 300US" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_11" edc:desc="Refresh every 330US" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_12" edc:desc="Refresh every 360US" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_13" edc:desc="Refresh every 390US" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_14" edc:desc="Refresh every 420US" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="REFRESH_15" edc:desc="Refresh every 450US" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
