Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21b/edc/ATSAML21E17B.PIC
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="STATUS" edc:nzwidth="0x10" edc:access="----------nnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3F" edc:addr="0x4300041A">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="PERR" edc:nzwidth="0x1" edc:desc="Parity Error"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Frame Error"/>
            <edc:SFRFieldDef edc:cname="BUFOVF" edc:nzwidth="0x1" edc:desc="Buffer Overflow"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:nzwidth="0x1" edc:desc="Clear To Send"/>
            <edc:SFRFieldDef edc:cname="ISF" edc:nzwidth="0x1" edc:desc="Inconsistent Sync Field"/>
            <edc:SFRFieldDef edc:cname="COLL" edc:nzwidth="0x1" edc:desc="Collision Detected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="SYNCBUSY" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7" edc:addr="0x4300041C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="SERCOM Enable Synchronization Busy"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:nzwidth="0x1" edc:desc="CTRLB Synchronization Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="DATA" edc:nzwidth="0x10" edc:access="-------nnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x1FF" edc:addr="0x43000428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x9" edc:desc="Data Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:addr="0x43000430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="DBGSTOP" edc:nzwidth="0x1" edc:desc="Debug Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:RegisterMap>
    <edc:RegisterMap edc:id="SERCOM5/USART_INT">
      <edc:SFRDef ltx:memberofperipheral="SERCOM5" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="-nnnnnnnnnnn--nnnnn----nn--nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7FF3E19F" edc:addr="0x43000400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM5">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x3" edc:desc="Operating Mode">
              <edc:SFRFieldSemantic edc:cname="USART_EXT_CLK" edc:desc="USART with external clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="USART_INT_CLK" edc:desc="USART with internal clock" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI in slave operation" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI in master operation" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="I2C_SLAVE" edc:desc="I2C slave operation" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="I2C_MASTER" edc:desc="I2C master operation" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run during Standby"/>
            <edc:SFRFieldDef edc:cname="IBON" edc:nzwidth="0x1" edc:desc="Immediate Buffer Overflow Notification"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SAMPR" edc:nzwidth="0x3" edc:desc="Sample">
              <edc:SFRFieldSemantic edc:cname="16X_ARITHMETIC" edc:desc="16x over-sampling using arithmetic baudrate generation" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="16X_FRACTIONAL" edc:desc="16x over-sampling using fractional baudrate generation" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="8X_ARITHMETIC" edc:desc="8x over-sampling using arithmetic baudrate generation" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="8X_FRACTIONAL" edc:desc="8x over-sampling using fractional baudrate generation" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="3X_ARITHMETIC" edc:desc="3x over-sampling using arithmetic baudrate generation" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXPO" edc:nzwidth="0x2" edc:desc="Transmit Data Pinout">
              <edc:SFRFieldSemantic edc:cname="PAD0" edc:desc="PAD[0] = TxD; PAD[1] = XCK" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PAD1" edc:desc="PAD[2] = TxD; PAD[3] = XCK" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PAD2" edc:desc="PAD[0] = TxD; PAD[2] = RTS; PAD[3] = CTS" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXPO" edc:nzwidth="0x2" edc:desc="Receive Data Pinout">
              <edc:SFRFieldSemantic edc:cname="PAD0" edc:desc="SERCOM PAD[0] is used for data reception" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PAD1" edc:desc="SERCOM PAD[1] is used for data reception" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PAD2" edc:desc="SERCOM PAD[2] is used for data reception" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="PAD3" edc:desc="SERCOM PAD[3] is used for data reception" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SAMPA" edc:nzwidth="0x2" edc:desc="Sample Adjustment">
              <edc:SFRFieldSemantic edc:cname="ADJ0" edc:desc="16x Over-sampling = 7-8-9; 8x Over-sampling = 3-4-5" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ADJ1" edc:desc="16x Over-sampling = 9-10-11; 8x Over-sampling = 4-5-6" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ADJ2" edc:desc="16x Over-sampling = 11-12-13; 8x Over-sampling = 5-6-7" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ADJ3" edc:desc="16x Over-sampling = 13-14-15; 8x Over-sampling = 6-7-8" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FORM" edc:nzwidth="0x4" edc:desc="Frame Format">
              <edc:SFRFieldSemantic edc:cname="USART_FRAME_NO_PARITY" edc:desc="USART frame" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="USART_FRAME_WITH_PARITY" edc:desc="USART frame with parity" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="USART_FRAME_AUTO_BAUD_NO_PARITY" edc:desc="Auto-baud - break detection and auto-baud" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="USART_FRAME_AUTO_BAUD_WITH_PARITY" edc:desc="Auto-baud - break detection and auto-baud with parity" edc:when="(field &amp; 0xF) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMODE" edc:nzwidth="0x1" edc:desc="Communication Mode">
              <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Asynchronous Communication" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Synchronous Communication" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW" edc:desc="TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH" edc:desc="TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DORD" edc:nzwidth="0x1" edc:desc="Data Order">
              <edc:SFRFieldSemantic edc:cname="MSB" edc:desc="MSB is transmitted first" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LSB" edc:desc="LSB is transmitted first" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
