Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21b/edc/ATSAML21E17B.PIC
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTENSET" edc:nzwidth="0x10" edc:access="------nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FF" edc:addr="0x41000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:nzwidth="0x1" edc:desc="Suspend Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MSOF" edc:nzwidth="0x1" edc:desc="Micro Start of Frame Interrupt Enable in High Speed Mode"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:nzwidth="0x1" edc:desc="Start Of Frame Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:nzwidth="0x1" edc:desc="End of Reset Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:nzwidth="0x1" edc:desc="End Of Resume Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LPMNYET" edc:nzwidth="0x1" edc:desc="Link Power Management Not Yet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LPMSUSP" edc:nzwidth="0x1" edc:desc="Link Power Management Suspend Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="INTFLAG" edc:nzwidth="0x10" edc:access="------nnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3FF" edc:addr="0x4100001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="SUSPEND" edc:nzwidth="0x1" edc:desc="Suspend"/>
            <edc:SFRFieldDef edc:cname="MSOF" edc:nzwidth="0x1" edc:desc="Micro Start of Frame in High Speed Mode"/>
            <edc:SFRFieldDef edc:cname="SOF" edc:nzwidth="0x1" edc:desc="Start Of Frame"/>
            <edc:SFRFieldDef edc:cname="EORST" edc:nzwidth="0x1" edc:desc="End of Reset"/>
            <edc:SFRFieldDef edc:cname="WAKEUP" edc:nzwidth="0x1" edc:desc="Wake Up"/>
            <edc:SFRFieldDef edc:cname="EORSM" edc:nzwidth="0x1" edc:desc="End Of Resume"/>
            <edc:SFRFieldDef edc:cname="UPRSM" edc:nzwidth="0x1" edc:desc="Upstream Resume"/>
            <edc:SFRFieldDef edc:cname="RAMACER" edc:nzwidth="0x1" edc:desc="Ram Access"/>
            <edc:SFRFieldDef edc:cname="LPMNYET" edc:nzwidth="0x1" edc:desc="Link Power Management Not Yet"/>
            <edc:SFRFieldDef edc:cname="LPMSUSP" edc:nzwidth="0x1" edc:desc="Link Power Management Suspend"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTSMRY" edc:nzwidth="0x10" edc:access="--------rrrrrrrr" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xFF" edc:addr="0x41000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPINT0" edc:nzwidth="0x1" edc:desc="End Point 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT1" edc:nzwidth="0x1" edc:desc="End Point 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT2" edc:nzwidth="0x1" edc:desc="End Point 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT3" edc:nzwidth="0x1" edc:desc="End Point 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT4" edc:nzwidth="0x1" edc:desc="End Point 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT5" edc:nzwidth="0x1" edc:desc="End Point 5 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT6" edc:nzwidth="0x1" edc:desc="End Point 6 Interrupt"/>
            <edc:SFRFieldDef edc:cname="EPINT7" edc:nzwidth="0x1" edc:desc="End Point 7 Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPCFG0" edc:nzwidth="0x8" edc:access="nnnn-nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x41000100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="EPTYPE0" edc:nzwidth="0x3" edc:desc="End Point Type0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE1" edc:nzwidth="0x3" edc:desc="End Point Type1"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:nzwidth="0x1" edc:desc="NYET Token Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUSCLR0" edc:nzwidth="0x8" edc:access="wwww-www" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x41000104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle OUT Clear"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle IN Clear"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request Clear"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request Clear"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Clear"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUSSET0" edc:nzwidth="0x8" edc:access="wwww-www" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x41000105">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle OUT Set"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle IN Set"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request Set"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request Set"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 Ready Set"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 Ready Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPSTATUS0" edc:nzwidth="0x8" edc:access="rrrr-rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF7" edc:addr="0x41000106">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="DTGLOUT" edc:nzwidth="0x1" edc:desc="Data Toggle Out"/>
            <edc:SFRFieldDef edc:cname="DTGLIN" edc:nzwidth="0x1" edc:desc="Data Toggle In"/>
            <edc:SFRFieldDef edc:cname="CURBK" edc:nzwidth="0x1" edc:desc="Current Bank"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQ0" edc:nzwidth="0x1" edc:desc="Stall 0 Request"/>
            <edc:SFRFieldDef edc:cname="STALLRQ1" edc:nzwidth="0x1" edc:desc="Stall 1 Request"/>
            <edc:SFRFieldDef edc:cname="BK0RDY" edc:nzwidth="0x1" edc:desc="Bank 0 ready"/>
            <edc:SFRFieldDef edc:cname="BK1RDY" edc:nzwidth="0x1" edc:desc="Bank 1 ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTFLAG0" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:addr="0x41000107">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:nzwidth="0x1" edc:desc="Error Flow 0"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:nzwidth="0x1" edc:desc="Error Flow 1"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:nzwidth="0x1" edc:desc="Received Setup"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:nzwidth="0x1" edc:desc="Stall 0 In/out"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:nzwidth="0x1" edc:desc="Stall 1 In/out"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USB" edc:cname="EPINTENCLR0" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:addr="0x41000108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB">
            <edc:SFRFieldDef edc:cname="TRCPT0" edc:nzwidth="0x1" edc:desc="Transfer Complete 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRCPT1" edc:nzwidth="0x1" edc:desc="Transfer Complete 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL0" edc:nzwidth="0x1" edc:desc="Error Flow 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TRFAIL1" edc:nzwidth="0x1" edc:desc="Error Flow 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXSTP" edc:nzwidth="0x1" edc:desc="Received Setup Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="STALL0" edc:nzwidth="0x1" edc:desc="Stall 0 In/Out Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="STALL1" edc:nzwidth="0x1" edc:desc="Stall 1 In/Out Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
